[
  {
    "question": "Waar kan ik de Vuurwerkverkenner voor gebruiken?",
    "info": "De Vuurwerkverkenner is een hulpmiddel dat gebruikt kan worden voor het herkennen van professioneel knalvuurwerk in forensisch onderzoek, en is ontwikkeld door het Nederlands Forensisch Instituut (NFI). De Vuurwerkverkenner kun je dus niet gebruiken voor het terugvinden van consumentenvuurwerk. Wanneer je een foto van gevonden snippers uploadt en/of tekst op de snippers invult, helpt de Vuurwerkverkenner met het vinden van gelijkende etiketten. Je krijgt etiketten uit een database te zien, op volgorde van gelijkenis volgens de Vuurwerkverkenner. Als de ingevoerde tekst niet voorkomt op een etiket, wordt het weggefilterd uit de resultaten. De Vuurwerkverkenner geeft dus suggesties die je zelf nog moet controleren. Door op een etiket te klikken, krijg je meer informatie over het artikel, zoals een indicatie voor de gevaarzetting. Let op: iedere situatie met vuurwerk is uniek, dus de gevaarzetting is niet meer dan een indicatie. De Vuurwerkverkenner kan een NFI-rapport niet vervangen."
  },
  {
    "question": "Waar kan ik de Vuurwerkverkenner niet voor gebruiken?",
    "info": "De Vuurwerkverkenner werkt niet met snippers (of tekst) van consumentenvuurwerk. Als het vuurwerk niet voorkomt in de database, kan het dus niet gevonden worden. De suggesties van de Vuurwerkverkenner moet je altijd zelf controleren. De Vuurwerkverkenner kan een NFI-rapport niet vervangen."
  },
  {
    "question": "Hoe werkt de Vuurwerkverkenner?",
    "info": "Voor het bepalen van de mate van gelijkenis van de foto met de etiketten wordt een AI-model gebruikt. De Vuurwerkverkenner kan hiermee, in vergelijking met een mens, snel de etiketten sorteren op volgorde van gelijkenis. Echter, de Vuurwerkverkenner is minder goed in het zien van gelijkenis en verschillen dan een mens. Het is dus aan de gebruiker om na te gaan of de getoonde etiketten goede suggesties zijn. Naast een foto kan tekst worden ingevoerd. Als de ingevoerde tekst niet voorkomt op een etiket, wordt het weggefilterd uit de resultaten."
  },
  {
    "question": "Hoe maak ik een goede foto?",
    "info": "Hoe beter de foto, hoe groter de kans op succes. Verzamel zoveel mogelijk snippers en zet die samen op &eacute;&eacute;n foto. Maak de foto recht van boven en bij voorkeur in landschapsmodus (niet portretmodus). Het model kan minder goed omgaan met donkere foto's, of met niet-effen achtergronden. Gebruik daarom dus zoveel mogelijk een effen, en bij voorkeur lichte achtergrond. Zorg voor een goede belichting. Laat de snippers weg die geen stuk van het etiket bevatten. Laat andere objecten dan snippers weg (gebruik ook geen liniaal)."
  },
  {
    "question": "Hoe werkt het tekstfilter?",
    "info": "Als er nog tekst te lezen is op een van de snippers van het ontplofte vuurwerk, dan kun je deze meegeven aan de Vuurwerkverkenner. De Vuurwerkverkenner gebruikt deze tekst om etiketten te selecteren waar dezelfde tekst op staat. Het invullen van deze tekst kan dus erg helpen om het juiste type vuurwerk te vinden. Ook delen van woorden mogen worden ingevoerd. De Vuurwerkverkenner let hierbij alleen op 'kale tekst', dus niet op (Romeinse) cijfers, accenten, leestekens en dergelijke. Ook kijkt de Vuurwerkverkenner alleen naar het Latijnse alfabet (dus niet naar bijvoorbeeld Cyrillische tekens). Het tekstfilter is niet hoofdlettergevoelig. Omdat de Vuurwerkverkenner etiketten wegfiltert waar de ingevoerde tekst niet op staat, moet je goed opletten dat je geen overschrijffouten maakt, want het tekstfilter kijkt alleen naar exacte overeenkomsten. Bij twijfel kun je de tekst beter niet invoeren."
  },
  {
    "question": "Vindt de Vuurwerkverkenner altijd het juiste vuurwerk?",
    "info": "Het korte antwoord is: nee. De Vuurwerkverkenner doet suggesties, maar deze kloppen niet altijd. Wanneer een snipper afkomstig is van een etiket dat niet in de database is opgenomen, zal de Vuurwerkverkenner verkeerde etiketten als suggestie geven. Het kan ook gebeuren dat de Vuurwerkverkenner vindt dat een ander etiket beter bij de snippers past dan het etiket waar de snippers echt vanaf komen. Het is aan de gebruiker om na te gaan of de Vuurwerkverkenner goede suggesties heeft gedaan. Wel is het zo dat hoe beter de foto, hoe groter de kans op succes is. De Vuurwerkverkenner is slechts een hulpmiddel; het menselijk oordeel is leidend."
  },
  {
    "question": "Hoe zijn de resultaten gesorteerd?",
    "info": "De resultaten zijn gesorteerd op basis van gelijkenis tussen de snippers op de ingevoerde foto en de etiketten in de database. De mate van gelijkenis wordt bepaald door een AI-model dat speciaal hiervoor gebouwd is. Daarnaast zijn de resultaten gefilterd op basis van overeenkomst tussen de ingevoerde tekst en de teksten die op de etiketten staan. Als de resultaten bepaald zijn, krijg je per pagina 5 etiketten te zien. Van sommige soorten vuurwerk zijn er meerdere varianten, die erg op elkaar lijken. Deze voegen we samen tot een 'categorie'. In zo'n geval wordt een willekeurig etiket van de categorie getoond. Je kan dan op het etiket klikken om alle varianten van deze categorie vuurwerk te zien."
  },
  {
    "question": "Waarom zie ik geen resultaten?",
    "info": "Om resultaten te zien zijn twee dingen nodig:<br>1. Upload een foto en/of voer tekst in die je op de snippers ziet.<br>2. Druk op de knop 'Verken vuurwerk'. De resultaten worden gefilterd op basis van de ingevoerde tekst. Het kan zijn dat de ingevoerde tekst op geen enkel etiket in de database staat waar de Vuurwerkverkenner gebruik van maakt. Als er na het uploaden van de foto en tekst nog steeds geen resultaten verschijnen, probeer het dan nog eens met minder of helemaal zonder tekst."
  },
  {
    "question": "Kan ik de resultaten gebruiken als bewijsmateriaal in een strafzaak?",
    "info": "Nee. De Vuurwerkverkenner kan niet een NFI rapport vervangen en kan ook niet gebruikt worden als bewijsmateriaal in een strafzaak."
  },
  {
    "question": "Hoe zit de Vuurwerkverkenner technisch in elkaar?",
    "info": "De Vuurwerkverkenner maakt gebruik van een AI-model. Dit model heeft 'geleerd' om het meest gelijkende etiket te vinden bij een foto van snippers van afgestoken vuurwerk. Dit doen we door het model combinaties van snippers van afgestoken vuurwerk en snippers van een willekeurig etiket te tonen, waarbij het voor de ontwikkelaars bekend was of de snippers en het etiket van hetzelfde vuurwerk komen. Het model kan berekenen in hoeverre de snippers en een etiket van hetzelfde vuurwerk afkomstig zijn. Als het model er sterk naast zat, dan is het model bijgesteld zodat het steeds beter wordt in het vergelijken van snippers met etiketten."
  },
  {
    "question": "Worden mijn gegevens opgeslagen?",
    "info": "Nee. De ingevoerde foto en/of tekst wordt eenmalig gebruikt om resultaten te vinden wanneer op 'Verken vuurwerk' wordt gedrukt, en wordt verder niet opgeslagen. Ook andere gegevens, zoals IP-adressen, worden niet bijgehouden."
  },
  {
    "question": "Hoe kan ik contact opnemen met het Nederlands Forensisch Instituut bij onverwachte resultaten of andere vragen?",
    "info": "Het Nederlands Forensisch Instituut heeft de Vuurwerkverkenner ontwikkeld en onderhoudt deze. Bij vragen of suggesties kun je mailen naar <a href=\"mailto:vuurwerkverkenner@nfi.nl\">vuurwerkverkenner@nfi.nl</a>. Vermeld bij specifieke vragen over resultaten het versienummer van het algoritme en de database (zie hieronder)."
  },
  {
    "question": "Open source en versienummers",
    "info": "De code van deze applicatie kun je vinden op <a href=\"https://github.com/netherlandsForensicInstitute/vuurwerkverkenner\" target=\"_blank\">GitHub</a>. Het getrainde deep-learning model kun je vinden op <a href=\"https://huggingface.co/NetherlandsForensicInstitute/vuurwerkverkenner\" target=\"_blank\">HuggingFace</a>, met daarbij een technische toelichting over de architectuur, het trainingsproces en de evaluatie. De dataset die de applicatie gebruikt, kun je ook vinden op <a href=\"https://huggingface.co/datasets/NetherlandsForensicInstitute/vuurwerkverkenner-data\" target=\"_blank\">HuggingFace</a>. De huidige versie van het model heeft commit hash (versienummer) 9d9f389. De huidige versie van de dataset heeft commit hash (versienummer) 8cfc23c."
  }
]
